app/controllers/profile/friends_controller.rb

  def look_for
    @players = Player.where('name LIKE ?',"%#{params[:name]}%")
---
SELECT "players".* FROM "players" WHERE (name LIKE '%ф%')