app/controllers/games_controller.rb

  def new #new game
    @types = Type.all
---
SELECT "types".* FROM "types"