app/controllers/game_search_controller.rb

SELECT "types".* FROM "types"
---
  def main
    @types = Type.all