app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params.merge(host_id: current_player.id))
    if @team.save
---
INSERT INTO "teams" ("name", "type_id", "host_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["type_id", 1], ["host_id", 1], ["created_at", "2016-05-31 23:32:55.897201"], ["updated_at", "2016-05-31 23:32:55.897201"]]

  def new
    @types = Type.all
---
SELECT "types".* FROM "types"

  def search
    @types = Type.all
---
SELECT "types".* FROM "types"

  def look_for_teams
    if params[:type] == ""
      teams = Team.where('name LIKE ?',"%#{params[:name]}%")
    else
      teams = Team.where('name LIKE ? and type_id = ?',"%#{params[:name]}%", params[:type])
    end

    if teams.empty?
---
SELECT "teams".* FROM "teams" WHERE (name LIKE '%%' and type_id = '1')
SELECT COUNT(*) FROM "teams" WHERE (name LIKE '%a%' and type_id = '4')