app/views/teams/partials/_played_game.html.haml

    .col-md-1
      %a.btn.btn-default.glyphicon.glyphicon-eye-open{:href => "#{game_path(game)}"}
    .col-md-5
      .row
        .col-md-10.team{:style => "background-image: url(#{game.first_team.logo(:medium)}); background-repeat:no-repeat;    background-position:1000px 1000px;"}
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]