app/views/teams/partials/_team_color_box.html.haml

SELECT "team_colors".* FROM "team_colors" WHERE "team_colors"."team_id" = $1  [["team_id", 1]]
---
    .team-color-box
      - team.colors.each do |color|
        .panel.team-color-panel{:style => "background-color: #{color.color}"}