app/views/common/_game_spectator_actions.html.haml

    - if game.not_host? current_player
      - if game.claimers_and_players.include? current_player
---
SELECT  1 AS one FROM "players" INNER JOIN "player_games" ON "players"."id" = "player_games"."player_id" WHERE "player_games"."game_id" = $1 AND "players"."id" = $2 LIMIT 1  [["game_id", 4], ["id", 1]]